title: Potential Linux Reverse Shell Via /dev/tcp
id: 22222222-2222-2222-2222-222222222222
status: test
description: Detects a bash reverse shell using /dev/tcp redirection.
logsource:
    product: linux
    category: process_creation
detection:
    selection:
        CommandLine|contains: '/dev/tcp/'
    condition: selection
level: critical
tags:
    - attack.execution
    - attack.t1059.004
